const editor = document.querySelector('.font-preview-content');
const isVariable = document.querySelector('.twf-font-preview-variable');
let fontSize = 28;

if (editor) {
  const previewText = [
    'หมอกสามฤดู กองมูเสียดฟ้า ป่าเขียวขจี ผู้คนดี ประเพณีงาม ลือนามถิ่นบัวตอง',
    'เหนือสุดในสยาม ชายแดนสามแผ่นดิน ถิ่นวัฒนธรรมล้านนา ล้ำค่าพระธาตุดอยตุง',
    'แข่งเรือลือเลื่อง เมืองงาช้างดำ จิตรกรรมวัดภูมินทร์ แดนดินส้มสีทอง เรืองรองพระธาตุแช่แห้ง',
    'ดอยสุเทพเป็นศรี ประเพณีเป็นสง่า บุปผชาติล้วนงามตา นามล้ำค่านครพิงค์',
    'ถ่านหินลือชา รถม้าลือลั่น เครื่องปั้นลือนาม งามพระธาตุลือไกล ฝึกช้างใช้ลือโลก',
    'เหล็กน้ำพี้ลือเลื่อง เมืองลางสาดหวาน บ้านพระยาพิชัยดาบหัก ถิ่นสักใหญ่ของโลก',
    'หลวงพ่อองค์ดำลือเลื่อง เมืองฟ้าแดดสงยาง โปงลางเลิศล้ำ วัฒนธรรมภูไท ผ้าไหมแพรวา ผาเสวยภูพาน มหาธารลำปาว ไดโนเสาร์สัตว์โลกล้านปี',
    'หอแก้วสูงเสียดฟ้า ภูผาเทิบแก่งกะเบา แปดเผ่าชนพื้นเมือง ลือเลื่องมะขามหวาน กลองโบราณล้ำเลิศ ถิ่นกำเนิดลำผญา ตระการตาชายโขง เชื่อมโยงอินโดจีน',
    'พระธาตุเชิงชุมคู่บ้าน พระตำหนักภูพานคู่เมือง งามลือเลื่องหนองหาน แลตระการปราสาทผึ้ง สวยสุดซึ้งสาวภูไท ถิ่นมั่นในพุทธธรรม',
    'สุรินทร์ ถิ่นช้างใหญ่ ผ้าไหมงาม ประคำสวย ร่ำรวยปราสาท ผักกาดหวาน ข้าวสารหอม งามพร้อมวัฒนธรรม',
    'กรมหลวงประจักษ์ฯ สร้างเมือง ลือเลื่องแหล่งธรรมะ อารยธรรมห้าพันปี ธานีผ้าหมี่ขิด ธรรมชาติเนรมิตทะเลบัวแดง',
    'อุบลเมืองดอกบัวงาม แม่น้ำสองสี มีปลาแซ่บหลาย หาดทรายแก่งหิน ถิ่นไทยนักปราชญ์ ทวยราษฎร์ใฝ่ธรรม งามล้ำเทียนพรรษา ผาแต้มก่อนประวัติศาสตร์ ฉลาดภูมิปัญญาท้องถิ่น ดินแดนอนุสาวรีย์คนดีศรีอุบล',
    'กำเนิดแม่น้ำชี สดุดีพญาแลผู้กล้า ปรางค์กู่เป็นสง่า ล้ำค่าพระธาตุชัยภูมิ สมบูรณ์ป่าเขาสรรพสัตว์ เด่นชัดลายผ้าไหม ดอกกระเจียวงามลือไกล อารยธรรมไทยทวารวดี',
    'ภูทอกแหล่งพระธรรม ค่าล้ำยางพารา งามตาแก่งอาฮง บึงโขงหลงเพลินใจ น้ำตกใสเจ็ดสี ประเพณีแข่งเรือ เหนือสุดแดนอีสาน นมัสการหลวงพ่อใหญ่ ศูนย์รวมใจศาลสองนาง',
    'มรดกโลกล้ำเลิศ กำเนิดลายสือไทย เล่นไฟลอยกระทง ดำรงพุทธศาสนา งามตาผ้าตีนจก สังคโลกทองโบราณ สักการแม่ย่าพ่อขุน รุ่งอรุณแห่งความสุข',
    'กรุงเทพฯ ดุจเทพสร้าง เมืองศูนย์กลางการปกครอง วัดวังงามเรืองรอง เมืองหลวงของประเทศไทย',
    'ส้มโอหวาน ข้าวสารขาว ลูกสาวงาม ข้าวหลามหวานมัน สนามจันทร์งามล้น พุทธมณฑลคู่ธานี พระปฐมเจดีย์เสียดฟ้า สวยงามตาแม่น้ำท่าจีน',
    'วังนารายณ์คู่บ้าน ศาลพระกาฬคู่เมือง ปรางค์สามยอดลือเลื่อง เมืองแห่งดินสอพอง เขื่อนป่าสักชลสิทธิ์เกริกก้อง แผ่นดินทองสมเด็จพระนารายณ์',
    'อุทัยธานี เมืองพระชนกจักรี ปลาแรดรสดี ประเพณีเทโว ส้มโอบ้านน้ำตก มรดกโลกห้วยขาแข้ง แหล่งต้นน้ำสะแกกรัง ตลาดนัดดังโคกระบือ',
    'พระสมเด็จเกษไชโย หลวงพ่อโตองค์ใหญ่ วีรไทยใจกล้า ตุ๊กตาชาววัง โด่งดังจักสาน ถิ่นฐานทำกลอง เมืองสองพระนอน',
    'พระพุทธบาทสูงค่า เขื่อนป่าสักชลสิทธิ์ ฐานผลิตอุตสาหกรรม เกษตรนำล้ำแหล่งเที่ยว หนึ่งเดียวกะหรี่ปั๊บนมดี ประเพณีตักบาตรดอกไม้งาม เหลืองอร่ามทุ่งทานตะวัน ลือลั่นเมืองชุมทาง',
    'แม่น้ำบางปะกงแหล่งชีวิต พระศักดิ์สิทธิ์หลวงพ่อโสธร พระยาศรีสุนทรปราชญ์ภาษาไทย เขาอ่างฤๅไนป่าสมบูรณ์',
    'น้ำตกลือเลื่อง เมืองผลไม้ พริกไทยพันธุ์ดี อัญมณีมากเหลือ เสื่อจันทบูร สมบูรณ์ธรรมชาติ สมเด็จพระเจ้าตากสินมหาราช รวมญาติกู้ชาติที่จันทบุรี',
    'เมืองเกาะครึ่งร้อย พลอยแดงค่าล้ำ ระกำแสนหวาน หลังอานหมาดี ยุทธนาวีเกาะช้าง สุดทางบูรพา',
    'ผลไม้รสล้ำ อุตสาหกรรมก้าวหน้า น้ำปลารสเด็ด เกาะเสม็ดสวยหรู สุนทรภู่กวีเอก',
    'คนสวยโพธาราม คนงามบ้านโป่ง เมืองโอ่งมังกร วัดขนอนหนังใหญ่ ตื่นใจถ้ำงาม ตลาดน้ำดำเนินฯ เพลินค้างคาวร้อยล้าน ย่านยี่สกปลาดี',
    'แคว้นโบราณ ด่านเจดีย์ มณีเมืองกาญจน์ สะพานข้ามแม่น้ำแคว แหล่งแร่น้ำตก',
    'ไข่มุกอันดามัน สวรรค์เมืองใต้ หาดทรายสีทอง สองวีรสตรี บารมีหลวงพ่อแช่ม',
    'นกน้ำเพลินตา สมิหลาเพลินใจ เมืองใหญ่สองทะเล เสน่ห์สะพานป๋า ศูนย์การค้าแดนใต้',
    'เมืองหนังโนราห์ อู่นาข้าว พราวน้ำตก แหล่งนกน้ำ ทะเลสาบงาม เขาอกทะลุ น้ำพุร้อน',
    'ประตูภาคใต้ ไหว้เสด็จในกรมฯ ชมไร่กาแฟ แลหาดทรายรี ดีกล้วยเล็บมือ ขึ้นชื่อรังนก',
    'เมืองงามสามวัฒนธรรม ศูนย์ฮาลาลเลิศล้ำ ชนน้อมนำศรัทธา ถิ่นธรรมชาติงามตา ปัตตานีสันติสุขแดนใต้',
  ];

  function randomPreview() {
    const randomText = Math.floor(Math.random() * previewText.length);
    editor.innerHTML = previewText[randomText];
  }

  randomPreview();

  editor.addEventListener('paste', (e) => {
    e.preventDefault();
    const text = e.clipboardData.getData('text/plain');
    document.execCommand('insertHTML', false, text);
  });

  function setSize(val) {
    document.getElementById('previewSize').value = val;
    document.getElementById('previewSizeValue').textContent = val;
    editor.style.fontSize = val + 'px';
  }

  function setDefaultSize() {
    if (window.innerWidth >= 1400) {
      fontSize = 40;
    } else if (window.innerWidth >= 992) {
      fontSize = 36;
    } else if (window.innerWidth >= 768) {
      fontSize = 32;
    } else {
      fontSize = 28;
    }
  }
  setDefaultSize();
  setSize(fontSize);
  window.onresize = setDefaultSize;

  function setWidth(val) {
    editor.style.fontStretch = val + '%';
    if (isVariable) {
      document.getElementById('previewWidth').value = val;
      document.getElementById('previewWidthValue').textContent = val;
    }
  }

  function setWeight(val, title) {
    const previewWeightValue = document.getElementById('previewWeightValue');
    const previewWeight = document.getElementById('previewWeight');
    const dropdown = document.querySelector(
      '.twf-font-preview-settings-weight-dropdown button'
    );
    const defaultWeight = dropdown.dataset.defaultWeight;
    if (val === 'default') {
      editor.style.fontWeight = defaultWeight;
      if (isVariable) {
        previewWeightValue.textContent = defaultWeight;
        previewWeight.value = defaultWeight;
      } else {
        if (defaultWeight === '500') {
          dropdown.textContent = 'Medium (500)';
        } else {
          dropdown.textContent = 'Regular (400)';
        }
      }
    } else {
      editor.style.fontWeight = val;
      if (isVariable) {
        previewWeightValue.textContent = val;
        previewWeight.value = val;
      } else {
        dropdown.textContent = title;
      }
    }
  }
}
